---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinProf
source: html/0fda0197-8c00-98e3-ea6d-422f81ba8743.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinProf Property

The property labeled "Profile for fiber perlin noise" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodFiberPerlinProf { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".